
final dummySubjects = [
  {"code": "ECE20010-01",
    "name": "데이터 구조",
    "prof": "김영섭",
    "english": 20,
    "type": "전선",
    "time": "월1, 월2, 목1, 목2",
    "credit": 3,
    "faculty": "전산전자",
    "favorite": false,
  },
  {"code": "ECE20010-02",
    "name": "데이터 베이스",
    "prof": "남재창",
    "english": 0,
    "type": "전필",
    "time": "화2, 금2",
    "credit": 3,
    "faculty": "전산전자",
    "favorite": false,
  },
];

List faculty = [
  "전체", "경영경제", "국제어문", "공간환경시스템", "글로벌리더십", "기계제어", "법학부", "상담복지", "생명과학", "언론정보", "전산전자", "콘텐츠융합디자인", "ICT창업",
];

List type = [
  "전체", "실선", "실필", "교필", "교선", "교선필", "전필", "전선", "전선필",
];

List field = [
  "전체", "신앙", "인성", "세계관", "인문학", "사회과학", "자연과학", "리더십", "전공기초", "외국어", "제2외국어", "실무전산", "소통", "융복합", "ICT입문", "프로그래밍기초", "기독교신앙기초",
];

List credit = [
  "전체", 1, 2, 3, 4, 5, 6
];

List english = [
  "전체", 0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100
];

